code/views/trial-balance/view.php

SELECT * FROM "general_ledger" WHERE "ledger_id"=27
---
        <?php
            for($i=0; $i<sizeof($modelTrialBalance);$i++){
                echo "<tr>";
                    $modelAccount = GeneralLedger::find()->where(['ledger_id' => $modelTrialBalance[$i]->ledger_id])->one();