code/controllers/GeneralLedgerController.php

    public function actionView($id)
    {
        $this->layout = 'admin';
        $model = $this->findModel($id);
        $modelLedgerCheck = JournalCashDetails::find()->where(['ledger_id' => $id, 'journal_type'=>1])->all(); //check
        $modelLedgerCash = JournalCashDetails::find()->where(['ledger_id' => $id, 'journal_type'=>2])->all(); //cash
        $modelLedgerGeneral = JournalDetailsGeneral::find()->where(['ledger_id'=>$id])->all(); //general
        $modelLedgerReceipts = JournalDetailsCashReceipt::find()->where(['ledger_id'=>$id])->all(); //cash receipts
        $check_debit = 0;
        $check_credit = 0;
        $cash_credit = 0;
        $cash_debit = 0;
        $receipts_credit = 0;
        $receipts_debit = 0;
        $general_credit = 0;
        $general_debit = 0;


        $modelAssetAccount = GeneralLedger::find()->where(['ledger_id' => $id, 'account_code_type'=>1])->all();
        $modelLiabilityAccount = GeneralLedger::find()->where(['ledger_id' => $id, 'account_code_type'=>2])->all();
        $modelExpenseAccount = GeneralLedger::find()->where(['ledger_id' => $id, 'account_code_type'=>3])->all();
---
SELECT * FROM "journal_cash_details" WHERE ("ledger_id"='6') AND ("journal_type"=1)
SELECT * FROM "journal_cash_details" WHERE ("ledger_id"='6') AND ("journal_type"=2)
SELECT * FROM "journal_details_general" WHERE "ledger_id"='6'
SELECT * FROM "journal_details_cash_receipt" WHERE "ledger_id"='6'
SELECT * FROM "general_ledger" WHERE ("ledger_id"='6') AND ("account_code_type"=1)
SELECT * FROM "general_ledger" WHERE ("ledger_id"='6') AND ("account_code_type"=2)
SELECT * FROM "general_ledger" WHERE ("ledger_id"='6') AND ("account_code_type"=3)

    protected function findModel($id)
    {
        if (($model = GeneralLedger::findOne($id)) !== null) {
---
SELECT * FROM "general_ledger" WHERE "ledger_id"='6'