code/controllers/JournalEntryController.php

SELECT * FROM "journal_cash_details" WHERE ("journal_id"='7') AND ("type"=1)
SELECT * FROM "journal_cash_details" WHERE ("journal_id"='7') AND ("type"=2)
---
    public function actionView($id)
    {
        $this->layout = 'admin';
        $model=$this->findModel($id);
        $detailCredit= JournalCashDetails::find()->where(['journal_id' => $id, 'type'=>1])->all();
        $detailDebit= JournalCashDetails::find()->where(['journal_id' => $id, 'type'=>2])->all();

SELECT * FROM "journal_entry" WHERE "journal_id"='7'
---
    protected function findModel($id)
    {
        if (($model = JournalEntry::findOne($id)) !== null) {