code/controllers/JournalEntryCashReceiptController.php

    public function actionView($id)
    {
        $this->layout = 'admin';
        $model = $this->findModel($id);

        //get collections
        $detailCollectionCredit = JournalDetailsCashReceipt::find()->where(['journal_receipts_id'=>$id,'receipts_type'=>1, 'type'=>1])->all();
        $detailCollectionDebit = JournalDetailsCashReceipt::find()->where(['journal_receipts_id'=>$id,'receipts_type'=>1, 'type'=>2])->all();

       //get deposits
        $detailDepositCredit = JournalDetailsCashReceipt::find()->where(['journal_receipts_id'=>$id,'receipts_type'=>2, 'type'=>1])->all();
        $detailDepositDebit = JournalDetailsCashReceipt::find()->where(['journal_receipts_id'=>$id,'receipts_type'=>2, 'type'=>2])->all();
---
SELECT * FROM "journal_details_cash_receipt" WHERE ("journal_receipts_id"='1') AND ("receipts_type"=1) AND ("type"=1)
SELECT * FROM "journal_details_cash_receipt" WHERE ("journal_receipts_id"='1') AND ("receipts_type"=1) AND ("type"=2)
SELECT * FROM "journal_details_cash_receipt" WHERE ("journal_receipts_id"='1') AND ("receipts_type"=2) AND ("type"=1)
SELECT * FROM "journal_details_cash_receipt" WHERE ("journal_receipts_id"='1') AND ("receipts_type"=2) AND ("type"=2)