code/controllers/JournalEntryGeneralController.php

SELECT * FROM "journal_details_general" WHERE ("journal_general_id"='1') AND ("type"=1)
SELECT * FROM "journal_details_general" WHERE ("journal_general_id"='1') AND ("type"=2)
SELECT * FROM "journal_details_general"
SELECT * FROM "journal_entry_general"
---
    public function actionView($id)
    {
        $this->layout = 'admin';
        $model = $this->findModel($id);

        //
        $detailGeneralCredit = JournalDetailsGeneral::find()->where(['journal_general_id'=>$id, 'type'=>1])->all();
        $detailGeneralDebit = JournalDetailsGeneral::find()->where(['journal_general_id'=>$id, 'type'=>2])->all();
        $detailGeneral = JournalDetailsGeneral::find()->all();
        //$detailGeneralAccount = JournalEntryGeneral::find()->where(['journal_general_id'=>$id])->all();
        $detailGeneralJevNo = JournalEntryGeneral::find()->all();//get jev_no