code/controllers/TrialBalanceController.php

SELECT * FROM "general_ledger"
SELECT * FROM "journal_cash_details" WHERE ("ledger_id"=3) AND ("type"=2)
SELECT * FROM "journal_cash_details" WHERE ("ledger_id"=3) AND ("type"=1)
SELECT * FROM "journal_details_general" WHERE ("ledger_id"=3) AND ("type"=1)
SELECT * FROM "journal_details_general" WHERE ("ledger_id"=3) AND ("type"=2)
SELECT * FROM "journal_details_cash_receipt" WHERE ("ledger_id"=3) AND ("type"=1)
SELECT * FROM "journal_details_cash_receipt" WHERE ("ledger_id"=3) AND ("type"=2)
---
    public function actionView()
    {
        $this->layout = 'admin';
        //$model = $this->findModel($id);
        $modelGenLedger = GeneralLedger::find()->all();
        for($i=0; $i<sizeof($modelGenLedger); $i++){
            $total_credit = 0;
            $total_debit = 0;

            $modelDetailsDebit = JournalCashDetails::find()->where(['ledger_id'=>$modelGenLedger[$i]->ledger_id, 'type' =>2])->all();
            $modelDetailsCredit = JournalCashDetails::find()->where(['ledger_id'=>$modelGenLedger[$i]->ledger_id, 'type'=>1])->all();
            $modelDetailsGeneralCredit = JournalDetailsGeneral::find()->where(['ledger_id'=>$modelGenLedger[$i]->ledger_id, 'type'=>1])->all();
            $modelDetailsGeneralDebit = JournalDetailsGeneral::find()->where(['ledger_id'=>$modelGenLedger[$i]->ledger_id, 'type'=>2])->all();
            $modelDetailsReceiptCredit = JournalDetailsCashReceipt::find()->where(['ledger_id'=>$modelGenLedger[$i]->ledger_id, 'type'=>1])->all();
            $modelDetailsReceiptDebit = JournalDetailsCashReceipt::find()->where(['ledger_id'=>$modelGenLedger[$i]->ledger_id, 'type'=>2])->all();

SELECT * FROM "trial_balance" WHERE "ledger_id"=3
---
                }
            }

            $modelTrialBalance = TrialBalance::find()->where(['ledger_id' => $modelGenLedger[$i]->ledger_id])->one();

UPDATE "trial_balance" SET "amount_debit"=0, "amount_credit"=0 WHERE "tb_id"=3
SELECT * FROM "trial_balance"
---
                $modelTrialBalance->amount_credit = $total_credit;
                $modelTrialBalance->amount_debit = $total_debit;
                //$modelTrialBalance->active = $modelGenLedger[$i]->active;
                $modelTrialBalance->save();
            }

            $modelTrialBalanceAmount = TrialBalance::find()->all();

SELECT * FROM "trial_balance" WHERE "active"=1
---
           // $modelTrialBalanceAmount-save();
        }

        $modelTrialBalance = TrialBalance::find()->where(['active'=>1])->all();